## Primer Punto

In [2]:
a =3

while (a < 301) :
    print(a)
    a= a+3

3
6
9
12
15
18
21
24
27
30
33
36
39
42
45
48
51
54
57
60
63
66
69
72
75
78
81
84
87
90
93
96
99
102
105
108
111
114
117
120
123
126
129
132
135
138
141
144
147
150
153
156
159
162
165
168
171
174
177
180
183
186
189
192
195
198
201
204
207
210
213
216
219
222
225
228
231
234
237
240
243
246
249
252
255
258
261
264
267
270
273
276
279
282
285
288
291
294
297
300

## Segundo Punto

In [3]:
conda install pandas

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

## Package Plan ##

  environment location: C:\Users\emili\anaconda1

  added / updated specs:
    - pandas


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    conda-4.13.0               |   py39haa95532_0         923 KB
    ------------------------------------------------------------
                                           Total:         923 KB

The following packages will be UPDATED:

  conda                               4.12.0-py39haa95532_0 --> 4.13.0-py39haa95532_0



Downloading and Extracting Packages

conda-4.13.0         | 923 KB    |            |   0%
conda-4.13.0         | 923 KB    | 1          |   2%
conda-4.13.0         | 923 KB    | #5         |  16%
conda-4.13.0         | 923 KB    | ##7        |  28%
conda-4.13.0         | 923 KB    | #####5     |  55%
conda-4.13.0         | 923 KB    | ########## | 100%
conda-4.13.0         | 923 KB    | ########## | 100%
Preparing transaction: ...working... done
Verifying transaction: ...working... done
Executing transaction: ...working... done

Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

In [5]:
pd.read_excel?

In [6]:
data=pd.read_excel("datosPE.xlsx")

In [8]:
data["Indice"]=data["Peso"]/data["Estatura"]

In [9]:
data

    ID Persona  Peso  Estatura     Indice
0            1    67      1.41  47.517730
1            2    99      1.83  54.098361
2            3    86      1.90  45.263158
3            4   118      1.65  71.515152
4            5   109      1.67  65.269461
..         ...   ...       ...        ...
95          96    88      1.49  59.060403
96          97    98      1.54  63.636364
97          98    95      1.57  60.509554
98          99    61      1.61  37.888199
99         100   107      1.62  66.049383

[100 rows x 4 columns]

## Tercer Punto

In [10]:
datas= pd.read_excel("datosCT.xlsx")

In [11]:
datas

    Unnamed: 0  Ingreso  Gasto
0        Enero     1340   1880
1      Febrero     2590   3130
2        Marzo     3570   2140
3        Abril     4450   3370
4         Mayo     1330   2990
5        Junio     1610   1970
6        Julio     1500   2230
7       Agosto     2270   1240
8   Septiembre     1910   1470
9      Octubre     2120   2280
10   Noviembre     3950   1870
11   Diciembre     1380   3140

## Utilidad

In [12]:
datas["Utilidas"]=datas["Ingreso"]-datas["Gasto"]

In [13]:
datas

    Unnamed: 0  Ingreso  Gasto  Utilidas
0        Enero     1340   1880      -540
1      Febrero     2590   3130      -540
2        Marzo     3570   2140      1430
3        Abril     4450   3370      1080
4         Mayo     1330   2990     -1660
5        Junio     1610   1970      -360
6        Julio     1500   2230      -730
7       Agosto     2270   1240      1030
8   Septiembre     1910   1470       440
9      Octubre     2120   2280      -160
10   Noviembre     3950   1870      2080
11   Diciembre     1380   3140     -1760

## Promedio de Gastos

In [14]:
gasto_neg=[1880,3130,2990,1970,2230,2280,4140]

In [15]:
prom=sum(gasto_neg)/len(gasto_neg)

In [16]:
prom

2660.0

## Ingresos Totales del AÃ±o

In [17]:
ingre=datas["Ingreso"].sum()

In [18]:
ingre

28020